"OK" = "OK";
"Quit" = "Wyjdź";
"Start" = "Uruchom wirtualną maszynę";//start button for every VM
"Cancel" = "Anuluj";
"Make Alias" = "Stwórz alias";
"Auto Update" = "Automatyczna aktualizacja";//turn on/off automatic updates for PD Runner
"Restore now?" = "Przywrócić teraz?";//confirmation before restoring snapshot(the original version was "Switch now?")
"New update!" = "Dostępna jest nowa aktualizacja!";//dialog, when an update is detected
"Stop all VMs" = "Zatrzymaj wszystkie wirtualne maszyny";
"Snapshots..." = "Zrzuty...";
"No Snapshots" = "Brak zrzutów";
"Preferences..." = "Preferencje...";
"Automatic mode" = "Tryb automatyczny";
"%@ is encrypted." = "%@ jest zaszyfrowany.";//dialog, when an encrypted VM is starting(like "Windows 11 is encrypted")
"Batch action" = "Operacja wsadowa";
"Start all VMs" = "Uruchom wszystkie wirtualne maszyny";
"User cancelled" = "Przerwane przez użytkownika";//dialog, when the user cancels before restoring the snapshot
//"Update VM List" = ""; This has been abandoned
"Update failed!" = "Aktualizacja niepowiodła się!";
"Unknown error." = "Nieznany błąd.";
"One more step!" = "Jeszcze jeden krok!";
"Input password" = "Podaj hasło";
"Launch at Login" = "Uruchom przy zalogowaniu";
"About PD Runner" = "O PD Runner";
"Failed to start!" = "Uruchomienie nie powiodło się!";
"Click OK to exit" = "Naciśnij OK, aby wyjść";
"No VMs were found" = "Nie znaleziono żadnych wirtualnych maszyn";
"No need to update" = "Nie ma potrzeby aktualizacji";//dialog, when no updates detected
"Block trial alert" = "Zablokuj ostrzeżenie o wersji próbnej";
"Restore %@ to [%@]?" = "Czy napewno chcesz przywrócić %@ to [%@]?";//dialog, confirmation before restoring snapshot(like "Restore Windows 11 to [Snapshot 1]?")
"No password entered" = "Nie wpisano hasła";
"Unsupported product!" = "Niewspierany produkt!";//dialog, when the user installed the "App Store Edition" of Parallels Desktop
"The requested operation has been cancelled." = "Żądana operacja została anulowana.";
"Get the trial first!" = "Uzyskaj najpierw wersję próbną!";//dialog, when the user is not logged into the Parallels Desktop account
"Check for Updates..." = "Sprawdź dostępność aktualizacji...";
"Don't remind me again" = "Nie przypominaj mi ponownie";
"No snapshots available." = "Brak dostępnych zrzutów.";
" is the latest version." = " jest aktualną wersją.";
"Nothing has changed." = "Nic się nie zmieniło.";
"Failed to install helper!" = "Nie udało się zainstalować narzędzia pomocniczego!";
"Parallels Desktop not installed" = "Parallels Desktop nie jest zainstalowane";
"Please select a snapshot to switch:" = "Proszę wybrać zrzut do przełączenia:";
"Unable to connect to Parallels Service" = "Nie można połączyć się z usługą Parallels Service";
"An error occurred while checking for updates." = "Wystąpił błąd podczas sprawdzania dostępności aktualizacji.";
" update is available,\nclick [OK] to download." = " aktualizacja jest dostępna,\nkliknij [OK] aby pobrać.";
"Make sure you are already a trial user\n(even if it is expired)\nThen restart your Mac and try again." = "Upewnij się że jesteś użytkownikiem wersji próbnej\n(nawet jeśli okres próbny wygasł)\nPotem uruchom ponownie Maca i spróbuj ponownie.";
"The App Store Edition is not supported.\nDownload the Standard Edition from:\nhttps://www.parallels.com" = "Wersja ze sklepu App Store nie jest wspierana.\nPobierz wersję standardową z:\nhttps://www.parallels.com";
"You must get a trial of Parallels Desktop.\nThen you can start VMs with PD Runner even if the trial period expires." = "Musisz najpierw uzyskać wersję próbną Parallels Desktop.\nPotem możesz dopiero uruchomić wirtualne maszyny z PD Runnerem, nawet jeśli okres próbny wygaśnie.";
"Due to the safety requirements of PD:\nIf the VM window is blank, just click the \n[Gear] icon in the upper right corner of the window and enter the VM password.\nThen the VM screen will be displayed." = "Ze względu na wymagania bezpieczeństwa PD:\nJeśli okno maszyny wirtualnej jest puste, po prostu kliknij ikonę \n[Koło zębate] w prawym górnym rogu okna i wprowadź hasło maszyny wirtualnej.\nPotem zostanie wyświetlony ekran maszyny wirtualnej.";
"VM in the \"Installation Complete\" state is detected. Do you want to complete the installation and enter the VM?" = "Wykryto maszynę wirtualną, gdzie \"Zakończona instalacja\". Czy chcesz zakończyć instalację i uruchomić maszynę wirtualną?"; //Had to get creative with this one.
"Complete the installation" = "Zakończ instalację"; //idk the context so I tried to sound neutral as possible.

//text in about panel
"Only for learning and research use! Please delete it within 24 hours after downloading." = "Służy tylko i wyłącznie do celów naukowych i rozwojowych! Proszę usuń ten program po 24 godzinach od jego pobrania.";
"Author:" = "Autor:";
"Translated by:" = "Przetłumaczone przez:";
